' ====================================================================
' 平城京エイリアン
' --------------------------------------------------------------------
' ﾌｧｲﾙ名   : heijo_pbsim.bas
' 開発環境 : Pocket BASIC Simulator
' 動作環境 : PB-100
' 著作権   : Kenoh
' 作成者   : Kenoh
' 作成日   : 2026/02/11
' 更新日   : 2026/02/21
' Version  : 0.26.2.21
' ====================================================================

' ====================================================================
' 初期設定
' ====================================================================
[P0]
10 VAC
' 最大穴掘り回数　５回
' 20 $="\LE \GE \LA \RA \DT\DV+\TR\CI":M=5
' 最大穴掘り回数　３回
20 $="\LE \GE \LA \RA \DT+\CI":M=3
30 INPUT "0:PB 1:SIM=",O
40 IF O=0 THEN #1
' PB-SIM動作の場合、ゲーム用ドット絵を読み込む
50 GLOAD "heijo_pbsim.bmp"
' タイトル
60 GOTO #1
' ====================================================================
' タイトル
' ====================================================================
[P1]
10 PRINT "HEIJO ALIAN"
' ゲーム開始時の初期設定
20 T=0:P=3:R=1
' メイン処理
30 GOTO #2
' ====================================================================
' メイン処理
' ====================================================================
[P2]
' ステージ開始時の初期設定
10 C=0:X=6:H=1:B=H:I=X:FOR W=0 TO 11:Z(W)=0:NEXT
20 PRINT:PRINT "STAGE";R
' 敵出現位置を算出
30 A=X:GOSUB #4
40 IF W-1=X THEN 30
41 IF W+1=X THEN 30
50 E=W:J=E
' 壁出現位置を算出
60 A=X:GOSUB #4
70 IF W=E THEN 60
71 IF W>3 THEN 74
72 IF W>E THEN 60
73 GOTO 80
74 IF W<8 THEN 80
75 IF W<E THEN 60
' 壁設定・表示
80 Z(W)=7
90 PRINT:PRINT CSR W;"\BX";
' --------------------------------------------------------------------
' メインループ開始
' --------------------------------------------------------------------
' プレイヤー表示
100 IF I<>X;PRINT CSR I;" ";
105 PRINT CSR X;MID(H+C+2,1);
' 敵表示
110 IF J<>E;PRINT CSR J;" ";
115 IF S=0;PRINT CSR E;"@";
116 IF Z(E)=M;IF S>0;PRINT CSR E;"*";
' キー入力
120 K$=KEY
125 IF K$="" THEN 300
' --------------------------------------------------------------------
' プレイヤー移動処理
' --------------------------------------------------------------------
' プレイヤー移動処理
130 I=X
140 IF K$="4" THEN 150
145 IF K$="6" THEN 160
149 GOTO 180
' 左移動
150 H=-1
151 IF B<>H THEN 170
152 IF X+H<0;IF Z(11)=0;X=11:GOTO 180
153 IF X+H>=0;IF Z(X+H)=0;X=X-1
159 GOTO 180
' 左移動
160 H=1
161 IF B<>H THEN 170
162 IF X+H>11;IF Z(0)=0;X=0:GOTO 180
163 IF X+H<=11;IF Z(X+H)=0;X=X+1
169 GOTO 180
' 方向転換のみの場合、移動しない
170 B=H
179 GOTO 300
' --------------------------------------------------------------------
' 穴掘り・穴埋め処理
' --------------------------------------------------------------------
' 穴掘り先の計算
180 W=X+H
' 範囲外・壁の場合はスキップ
190 IF W<0 THEN 300
200 IF W>11 THEN 300
201 IF Z(W)=7 THEN 300
' 穴掘り・穴埋め時、それぞれの処理へジャンプ
210 IF K$="Z" THEN 220
215 IF K$="X" THEN 230
219 GOTO 300
' 穴掘り
220 Z(W)=Z(W)+1
221 IF O=1;IF Z(W)<=M;BEEPS 1,10,1
222 IF Z(W)>M;Z(W)=M
229 GOTO 240
' 穴埋め
230 Z(W)=Z(W)-1
231 IF O=1;IF Z(W)>=0;BEEPS 1,5,1
232 IF Z(W)<0;Z(W)=0
239 GOTO 245
' 穴表示
240 IF Z(W)=M;IF S>0;:GOTO 300
245 PRINT CSR W;MID(Z(W)+8,1);
' --------------------------------------------------------------------
' 敵移動処理
' --------------------------------------------------------------------
' 敵が穴に落ちていれば、埋める判定へ
300 IF S>0 THEN 370
' 敵移動処理
305 J=E
' 移動先を算出
310 W=INT(RAN#*3)-1
311 IF RAN#<T/2000;W=1
315 IF X<E;IF Z(E-W)<>7;E=E-W:GOTO 320
316 IF X>E;IF Z(E+W)<>7;E=E+W
' 移動先の範囲外補正
320 IF E<0;E=0
330 IF E>11;E=11
' プレイヤーと敵の当たり判定
335 IF X=E THEN 500
' 敵が壁に当たる判定
350 IF Z(E)=7 THEN 400
' 敵が穴に落ちる判定
' 完全に掘った穴に敵が落ちた場合
351 IF Z(E)=M;S=1:F=1:T=T+10:IF O=1;BEEPS 1,10,200
' 穴掘り途中の穴に落ちた場合、穴を塞ぐ
355 IF S=0;IF Z(E)>0;S=3:F=0:T=T+1:IF O=1;BEEPS 1,5,200
360 GOTO 400
' 敵を埋める判定
370 IF Z(E)>0 THEN 390
371 IF F=0 THEN 390
' 敵を埋めた
380 PRINT CSR E;"\CR";
385 IF O=1;BEEPS 2,0,200
' 得点を加算して、次のステージへ
386 A=10:GOSUB #3:S=0:T=T+100:R=R+1
389 GOTO 10
' カウンタ処理
390 S=S+1
' 一定時間が過ぎたら、這い上がる
395 IF S>10;S=0:Z(E)=0
' 実機動作の場合、アニメーションしない
400 IF O=0 THEN 100
' PB-SIM動作の場合、プレイヤーキャラクターをアニメーション
410 C=C+4:IF C>4;C=0
' メインループ開始に戻る
420 GOTO 100
' --------------------------------------------------------------------
' ミス処理
' --------------------------------------------------------------------
500 PRINT:PRINT CSR X;"\NE";
510 IF O=1;BEEPS 5,0,800
520 A=10:GOSUB #3
530 PRINT CSR X;"\PI";
540 GOSUB #3
550 P=P-1:IF P>0 THEN 10
' --------------------------------------------------------------------
' ゲームオーバー
' --------------------------------------------------------------------
560 PRINT:PRINT "GAME OVER"
570 PRINT "SCORE";T
580 GOTO #1
' ====================================================================
' ウェイト処理
' param  A:待ち時間を指定
' ====================================================================
[P3]
10 FOR W=0 TO A:NEXT
20 RETURN
' ====================================================================
' 出現位置を算出
' param  A:対象外の位置
' ====================================================================
[P4]
10 W=INT(RAN#*12)
20 IF W=A THEN 10
30 RETURN
